{
    "_name_or_path": "./local/distilroberta-base",
    "architectures": [
        "RobertaForSequenceClassification"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": 0,
    "eos_token_id": 2,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
        "0": "AGGRAVATED ASSAULT",
        "1": "ARMED ROBBERY",
        "2": "ARSON",
        "3": "ASSAULTING PUBLIC OFFICER",
        "4": "AUTO THEFT",
        "5": "BLACKMAIL/EXTORTION/INTIMIDATION",
        "6": "BRIBERY AND CONFLICT OF INTEREST",
        "7": "BURGLARY",
        "8": "CHILD ABUSE",
        "9": "COCAINE OR CRACK VIOLATION OFFENSE UNSPECIFIED",
        "10": "COMMERCIALIZED VICE",
        "11": "CONTEMPT OF COURT",
        "12": "CONTRIBUTING TO DELINQUENCY OF A MINOR",
        "13": "CONTROLLED SUBSTANCE - OFFENSE UNSPECIFIED",
        "14": "COUNTERFEITING (FEDERAL ONLY)",
        "15": "DESTRUCTION OF PROPERTY",
        "16": "DRIVING UNDER INFLUENCE - DRUGS",
        "17": "DRIVING UNDER THE INFLUENCE",
        "18": "DRIVING WHILE INTOXICATED",
        "19": "DRUG OFFENSES - VIOLATION/DRUG UNSPECIFIED",
        "20": "DRUNKENNESS/VAGRANCY/DISORDERLY CONDUCT",
        "21": "EMBEZZLEMENT",
        "22": "EMBEZZLEMENT (FEDERAL ONLY)",
        "23": "ESCAPE FROM CUSTODY",
        "24": "FAMILY RELATED OFFENSES",
        "25": "FELONY - UNSPECIFIED",
        "26": "FLIGHT TO AVOID PROSECUTION",
        "27": "FORCIBLE SODOMY",
        "28": "FORGERY (FEDERAL ONLY)",
        "29": "FORGERY/FRAUD",
        "30": "FRAUD (FEDERAL ONLY)",
        "31": "GRAND LARCENY - THEFT OVER $200",
        "32": "HABITUAL OFFENDER",
        "33": "HEROIN VIOLATION - OFFENSE UNSPECIFIED",
        "34": "HIT AND RUN DRIVING",
        "35": "HIT/RUN DRIVING - PROPERTY DAMAGE",
        "36": "IMMIGRATION VIOLATIONS",
        "37": "INVASION OF PRIVACY",
        "38": "JUVENILE OFFENSES",
        "39": "KIDNAPPING",
        "40": "LARCENY/THEFT - VALUE UNKNOWN",
        "41": "LEWD ACT WITH CHILDREN",
        "42": "LIQUOR LAW VIOLATIONS",
        "43": "MANSLAUGHTER - NON-VEHICULAR",
        "44": "MANSLAUGHTER - VEHICULAR",
        "45": "MARIJUANA/HASHISH VIOLATION - OFFENSE UNSPECIFIED",
        "46": "MISDEMEANOR UNSPECIFIED",
        "47": "MORALS/DECENCY - OFFENSE",
        "48": "MURDER",
        "49": "OBSTRUCTION - LAW ENFORCEMENT",
        "50": "OFFENSES AGAINST COURTS, LEGISLATURES, AND COMMISSIONS",
        "51": "PAROLE VIOLATION",
        "52": "PETTY LARCENY - THEFT UNDER $200",
        "53": "POSSESSION/USE - COCAINE OR CRACK",
        "54": "POSSESSION/USE - DRUG UNSPECIFIED",
        "55": "POSSESSION/USE - HEROIN",
        "56": "POSSESSION/USE - MARIJUANA/HASHISH",
        "57": "POSSESSION/USE - OTHER CONTROLLED SUBSTANCES",
        "58": "PROBATION VIOLATION",
        "59": "PROPERTY OFFENSES - OTHER",
        "60": "PUBLIC ORDER OFFENSES - OTHER",
        "61": "RACKETEERING/EXTORTION (FEDERAL ONLY)",
        "62": "RAPE - FORCE",
        "63": "RAPE - STATUTORY - NO FORCE",
        "64": "REGULATORY OFFENSES (FEDERAL ONLY)",
        "65": "RIOTING",
        "66": "SEXUAL ASSAULT - OTHER",
        "67": "SIMPLE ASSAULT",
        "68": "STOLEN PROPERTY - RECEIVING",
        "69": "STOLEN PROPERTY - TRAFFICKING",
        "70": "TAX LAW (FEDERAL ONLY)",
        "71": "TRAFFIC OFFENSES - MINOR",
        "72": "TRAFFICKING - COCAINE OR CRACK",
        "73": "TRAFFICKING - DRUG UNSPECIFIED",
        "74": "TRAFFICKING - HEROIN",
        "75": "TRAFFICKING - OTHER CONTROLLED SUBSTANCES",
        "76": "TRAFFICKING MARIJUANA/HASHISH",
        "77": "TRESPASSING",
        "78": "UNARMED ROBBERY",
        "79": "UNAUTHORIZED USE OF VEHICLE",
        "80": "UNSPECIFIED HOMICIDE",
        "81": "VIOLENT OFFENSES - OTHER",
        "82": "VOLUNTARY/NONNEGLIGENT MANSLAUGHTER",
        "83": "WEAPON OFFENSE"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
        "AGGRAVATED ASSAULT": 0,
        "ARMED ROBBERY": 1,
        "ARSON": 2,
        "ASSAULTING PUBLIC OFFICER": 3,
        "AUTO THEFT": 4,
        "BLACKMAIL/EXTORTION/INTIMIDATION": 5,
        "BRIBERY AND CONFLICT OF INTEREST": 6,
        "BURGLARY": 7,
        "CHILD ABUSE": 8,
        "COCAINE OR CRACK VIOLATION OFFENSE UNSPECIFIED": 9,
        "COMMERCIALIZED VICE": 10,
        "CONTEMPT OF COURT": 11,
        "CONTRIBUTING TO DELINQUENCY OF A MINOR": 12,
        "CONTROLLED SUBSTANCE - OFFENSE UNSPECIFIED": 13,
        "COUNTERFEITING (FEDERAL ONLY)": 14,
        "DESTRUCTION OF PROPERTY": 15,
        "DRIVING UNDER INFLUENCE - DRUGS": 16,
        "DRIVING UNDER THE INFLUENCE": 17,
        "DRIVING WHILE INTOXICATED": 18,
        "DRUG OFFENSES - VIOLATION/DRUG UNSPECIFIED": 19,
        "DRUNKENNESS/VAGRANCY/DISORDERLY CONDUCT": 20,
        "EMBEZZLEMENT": 21,
        "EMBEZZLEMENT (FEDERAL ONLY)": 22,
        "ESCAPE FROM CUSTODY": 23,
        "FAMILY RELATED OFFENSES": 24,
        "FELONY - UNSPECIFIED": 25,
        "FLIGHT TO AVOID PROSECUTION": 26,
        "FORCIBLE SODOMY": 27,
        "FORGERY (FEDERAL ONLY)": 28,
        "FORGERY/FRAUD": 29,
        "FRAUD (FEDERAL ONLY)": 30,
        "GRAND LARCENY - THEFT OVER $200": 31,
        "HABITUAL OFFENDER": 32,
        "HEROIN VIOLATION - OFFENSE UNSPECIFIED": 33,
        "HIT AND RUN DRIVING": 34,
        "HIT/RUN DRIVING - PROPERTY DAMAGE": 35,
        "IMMIGRATION VIOLATIONS": 36,
        "INVASION OF PRIVACY": 37,
        "JUVENILE OFFENSES": 38,
        "KIDNAPPING": 39,
        "LARCENY/THEFT - VALUE UNKNOWN": 40,
        "LEWD ACT WITH CHILDREN": 41,
        "LIQUOR LAW VIOLATIONS": 42,
        "MANSLAUGHTER - NON-VEHICULAR": 43,
        "MANSLAUGHTER - VEHICULAR": 44,
        "MARIJUANA/HASHISH VIOLATION - OFFENSE UNSPECIFIED": 45,
        "MISDEMEANOR UNSPECIFIED": 46,
        "MORALS/DECENCY - OFFENSE": 47,
        "MURDER": 48,
        "OBSTRUCTION - LAW ENFORCEMENT": 49,
        "OFFENSES AGAINST COURTS, LEGISLATURES, AND COMMISSIONS": 50,
        "PAROLE VIOLATION": 51,
        "PETTY LARCENY - THEFT UNDER $200": 52,
        "POSSESSION/USE - COCAINE OR CRACK": 53,
        "POSSESSION/USE - DRUG UNSPECIFIED": 54,
        "POSSESSION/USE - HEROIN": 55,
        "POSSESSION/USE - MARIJUANA/HASHISH": 56,
        "POSSESSION/USE - OTHER CONTROLLED SUBSTANCES": 57,
        "PROBATION VIOLATION": 58,
        "PROPERTY OFFENSES - OTHER": 59,
        "PUBLIC ORDER OFFENSES - OTHER": 60,
        "RACKETEERING/EXTORTION (FEDERAL ONLY)": 61,
        "RAPE - FORCE": 62,
        "RAPE - STATUTORY - NO FORCE": 63,
        "REGULATORY OFFENSES (FEDERAL ONLY)": 64,
        "RIOTING": 65,
        "SEXUAL ASSAULT - OTHER": 66,
        "SIMPLE ASSAULT": 67,
        "STOLEN PROPERTY - RECEIVING": 68,
        "STOLEN PROPERTY - TRAFFICKING": 69,
        "TAX LAW (FEDERAL ONLY)": 70,
        "TRAFFIC OFFENSES - MINOR": 71,
        "TRAFFICKING - COCAINE OR CRACK": 72,
        "TRAFFICKING - DRUG UNSPECIFIED": 73,
        "TRAFFICKING - HEROIN": 74,
        "TRAFFICKING - OTHER CONTROLLED SUBSTANCES": 75,
        "TRAFFICKING MARIJUANA/HASHISH": 76,
        "TRESPASSING": 77,
        "UNARMED ROBBERY": 78,
        "UNAUTHORIZED USE OF VEHICLE": 79,
        "UNSPECIFIED HOMICIDE": 80,
        "VIOLENT OFFENSES - OTHER": 81,
        "VOLUNTARY/NONNEGLIGENT MANSLAUGHTER": 82,
        "WEAPON OFFENSE": 83
    },
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 514,
    "model_type": "roberta",
    "num_attention_heads": 12,
    "num_hidden_layers": 6,
    "pad_token_id": 1,
    "position_embedding_type": "absolute",
    "transformers_version": "4.5.1",
    "type_vocab_size": 1,
    "use_cache": true,
    "vocab_size": 50265
}